name: "translation_model"
backend: "python"
max_batch_size: 16
input [
  {
    name: "german_text_input"
    data_type: TYPE_STRING
    dims: [-1]
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [-1]
  }
]


instance_group [
  {
    kind: KIND_GPU  # Use KIND_CPU for CPU inference
    count: 1
  }
]

